<template>
  <h1>Данный сайт посвящен прогнозу погоды на сегодня и ближайшее время</h1>
  <h3>Почему погода важна для нас?</h3>
  <p>
    Прогноз погоды всегда был интересен и детям и взрослым. В любое время года человеку важно знать, какой будет погода
    – ясной или пасмурной, холодной или теплой. Можно ли будет взрослым поработать на свежем воздухе, а детям целый день
    играть на улице или придется провести время в помещении. О том, какая погода за окном подскажет данный сайт.
  </p>
  <h3>Lorem ipsum dolor sit amet, consectetur.</h3>
  <p>
    Как говорят в народе: "У природы нет плохой погоды". Каждая пора года приносит нам свою уникальную погоду, которая
    соответствует всем нормам нашего климата. Конечно, всем хочется солнышка и теплого уюта, но к нам часто приходят и
    нежелательные осадки. Нам повезло, потому что наша Родина размещается в наиболее благоприятной климатической зоне. У
    нас есть все четыре времени года: весна, зима, лето и осень. Нам зимой иногда хочется поехать в теплые края и
    погреться на солнышке. Но хотели бы мы в течение целого года жить в таком горячем климате. Наверное, что нет. Каждая
    пора года имеет свою хорошую погоду, которая постоянно меняется. Зимой мы встречаемся с морозом и снегом, которого
    так долго ждем осенью. Весна каждому человеку дарит вдохновение и приятные эмоции.
  </p>
  <h3>Lorem ipsum dolor sit amet, consectetur adipisicing elit.</h3>
  <p>
    Пробуждение природы, цветение деревьев и цветов приход тепла – такие приятные и долгожданные моменты. Летом мы
    обычно отдыхаем, набираемся солнечной энергии и просто радуемся жизни. В России каждое лето открывается сезон
    купания и принятия солнечных ванн. Это время любят все школьники, потому что начинаются трехмесячные каникулы. И
    последняя пора – это золотая осень. Это период, который всегда насыщен яркими красками. В это время люди с грустью
    прощаются с летом и начинают готовиться к зиме. Осень – это пора, которая дарит нам богатейшие урожаи, с помощью
    которых мы сможем пережить холодный период.
  </p>
  <img src="https://androidinsider.ru/wp-content/uploads/2020/04/weather-1280x720.jpg" alt="pic" />
  <h3>Lorem ipsum.</h3>
  <p>
    Цикличность погоды – это ее лучшая примета, которая помогает нам самое важное-не стоять в одном состоянии. Каждая
    пора играет важную роль для человека, потому что она формирует настроение и жизнь личности. Внешний вид, здоровье и
    психо-эмоциональное состояние зависят от погоды и времени года. К сожалению, многие люди являются метеозависимыми, и
    каждое изменение окружающей среды испытывают на своем организме. Обычно это состояние встречается у пожилых людей,
    но сейчас часто можно увидеть и молодых людей, которые зависят от погоды. Плохая погода за окном дает о себе знать
    чаще всего сердцу и суставам. Поэтому все люди. Которые имеют проблемы с сердцем, должны следить за прогнозами
    погоды и всегда носить с собой лекарства. Также от некоторых погодных перемен у многих людей начинает болеть голова.
    Однако не нужно через свое физическое состояние жаловаться на погоду, а в таком случае надо искать лекарства от
    своих болезней и воспринимать перемены как должное. Такой процесс является доказательством того, что человек и
    природа неразрывно связаны между собой. Действительно, окружающая среда и человечество является длинной цепочкой,
    каждое звено которой является незаменимой.
  </p>
  <h3>Lorem ipsum dolor sit amet, consectetur.</h3>
  <p>
    Любую погоду можно использовать с пользой и удовольствием. Осенний дождь за окном успокаивает и погружает в приятные
    воспоминания, а во время летнего ливня можно и побегать в сапожках и померить лужи. Зимний снежок, а особенно
    первый, всегда приносит радость не только детям, но и взрослым. Конечно, каждая погода является прекрасной, если она
    не приносит бедствия и не вредит существованию людей. Поэтому надо бережно относиться к окружающей среде и оберегать
    ее, потому что природа – это также живой организм, который может отомстить.
  </p>
</template>

<style scoped lang="scss">
h1 {
  margin-bottom: 30px;

  @media (max-width: 450px) {
    font-size: 20px;
  }
}
h3 {
  margin-bottom: 10px;
  text-align: start;
}
p {
  font-size: 15px;
  text-align: start;
  margin-bottom: 20px;
}
img {
  width: 50%;
  border-radius: 10px;
  @media (max-width: 450px) {
    width: 100%;
  }
}
</style>
